Revit 2027 API
ElementLogicalFilter.SetFilters Method
 Replaces current filters in the logical filter with any number of input filters.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetFilters(
	IList<ElementFilter> filters
)
Public Sub SetFilters (
	filters As IList(Of ElementFilter)
)
public:
void SetFilters(
	IList<ElementFilter^>^ filters
)
member SetFilters :
        filters : IList<ElementFilter> -> unit
Parameters
filters IList<ElementFilter>
 A collection of input filters.
Exceptions
Exception | Condition
ArgumentException |  The filter collection is empty, or contains invalid inputs.
ArgumentNullException |  A non-optional argument was null
Remarks
 The input filters will be copied.
See Also
Reference
ElementLogicalFilter Class
Autodesk.Revit.DB Namespace